# 1seq.py. Задание:
# Пользователь вводит количество элементов будущего списка
# После этого по очереди по одной вводит любые цифры
# Сохранить цифры в список
# Отсортировать список по возрастанию и вывести на экран
# Пример работы: Введите количество элементов: 3
# Введите 1 элемент: 5
# Введите 2 элемент: 2
# Введите 3 элемент: 4
# Вывод: [2, 4, 5]

number_str  = input('введите количество элементов списка ')
list_ = []
for i in range(0, int(number_str)):
    list_.append(int(input('Введите {} элемент: '.format(i+1))))
list_.sort()
print('Вывод: ', list_)